tiborsimon/embedded-tdd-headers/pic/8bit/pic18f65j11_tdd.h
#define CMIE                          522
#define OSCFIE                        523
#define PIR2                          524
#define TMR3IF                        525
#define LVDIF                         526
#define BCL1IF                        527
#define BCLIF                         528
#define CMIF                          529
#define OSCFIF                        530
#define IPR2                          531
#define TMR3IP                        532
#define LVDIP                         533
#define BCL1IP                        534
#define BCLIP                         535
#define CMIP                          536
#define OSCFIP                        537
#define PIE3                          538
#define RXBNIE                        539
#define CCP1IE                        540
#define RXB1IE                        541
#define CCP2IE                        542
#define TXB0IE                        543
#define TXB2IE                        544
#define TXBNIE                        545
#define TX2IE                         546
#define RC2IE                         547
#define PIR3                          548
#define RXBNIF                        549
#define CCP1IF                        550
#define CCP2IF                        551
#define TXBNIF                        552
#define TX2IF                         553
#define RC2IF                         554
#define IPR3                          555
#define RXBNIP                        556
#define CCP1IP                        557
#define CCP2IP                        558
#define TX2IP                         559
#define TXBNIP                        560
#define RC2IP                         561
#define EECON1                        562
#define EECON1_WR                     563
#define WREN                          564
#define WRERR                         565
#define FREE                          566
#define RCSTA1                        567
#define RCSTA1_RX9D                   568
#define RX9D1                         569
#define RCSTA1_RCD8                   570
#define RCSTA1_OERR                   571
#define OERR1                         572
#define RCSTA1_FERR                   573
#define FERR1                         574
#define RCSTA1_ADDEN                  575
#define ADDEN1                        576
#define RCSTA1_CREN                   577
#define CREN1                         578
#define SRENA                         579
#define SREN1                         580
#define RCSTA1_SREN                   581
#define RCSTA1_NOT_RC8                582
#define RCSTA1_RC9                    583
#define RCSTA1_nRC8                   584
#define RCSTA1_RC8_9                  585
#define RCSTA1_RX9                    586
#define RX91                          587
#define RCSTA1_SPEN                   588
#define SPEN1                         589
#define TXSTA1                        590
#define TX9D1                         591
#define TXSTA1_TX9D                   592
#define TXSTA1_TXD8                   593
#define TRMT1                         594
#define TXSTA1_TRMT                   595
#define BRGH1                         596
#define TXSTA1_BRGH                   597
#define SENDB1                        598
#define SENDB                         599
#define TXSTA1_SYNC                   600
#define SYNC1                         601
#define TXEN1                         602
#define TXSTA1_TXEN                   603
#define TX91                          604
#define TXSTA1_NOT_TX8                605
#define TXSTA1_TX8_9                  606
#define TXSTA1_TX9                    607
#define TXSTA1_nTX8                   608
#define TXSTA1_CSRC                   609
#define CSRC1                         610
#define PSPCON                        611
#define PSPMODE                       612
#define IBOV                          613
#define OBF                           614
#define IBF                           615
#define T3CON                         616
#define TMR3ON                        617
#define TMR3CS                        618
#define nT3SYNC                       619
#define NOT_T3SYNC                    620
#define T3SYNC                        621
#define T3INSYNC                      622
#define SOSCEN3                       623
#define T3CCP1                        624
#define T3CKPS                        625
#define T3CKPS0                       626
#define T3CKPS1                       627
#define T3CCP2                        628
#define T3CON_RD16                    629
#define RD163                         630
#define T3RD16                        631
#define CMCON                         632
#define CMEN0                         633
#define CMCON_CM                      634
#define CM0                           635
#define CMEN1                         636
#define CM1                           637
#define CMEN2                         638
#define CM2                           639
#define CIS                           640
#define C1INV                         641
#define C2INV                         642
#define CMCON_C1OUT                   643
#define CMCON_C2OUT                   644
#define CVRCON                        645
#define CVR                           646
#define CVR0                          647
#define CVR1                          648
#define CVR2                          649
#define CVR3                          650
#define CVRSS                         651
#define CVRR                          652
#define CVROEN                        653
#define CVROE                         654
#define CVREN                         655
#define ADCON2                        656
#define ADCS0                         657
#define ADCS                          658
#define ADCS1                         659
#define ADCS2                         660
#define ACQT0                         661
#define ACQT                          662
#define ACQT1                         663
#define ACQT2                         664
#define ADFM                          665
#define ADCON1                        666
#define PCFG0                         667
#define PCFG                          668
#define PCFG1                         669
#define PCFG2                         670
#define CHSN3                         671
#define PCFG3                         672
#define VCFG                          673
#define VCFG0                         674
#define VCFG01                        675
#define VCFG11                        676
#define VCFG1                         677
#define ADCON0                        678
#define ADON                          679
#define nDONE                         680
#define GO_nDONE                      681
#define NOT_DONE                      682
#define GODONE                        683
#define GO_DONE                       684
#define DONE                          685
#define GO                            686
#define GO_NOT_DONE                   687
#define CHS                           688
#define CHS0                          689
#define CHS1                          690
#define CHS2                          691
#define CHS3                          692
#define ADCAL                         693
#define SSPCON2                       694
#define SEN1                          695
#define SEN                           696
#define ADMSK11                       697
#define RSEN1                         698
#define RSEN                          699
#define ADMSK1                        700
#define PEN                           701
#define ADMSK21                       702
#define PEN1                          703
#define ADMSK2                        704
#define ADMSK31                       705
#define RCEN                          706
#define RCEN1                         707
#define ADMSK3                        708
#define ACKEN                         709
#define ACKEN1                        710
#define ADMSK41                       711
#define ADMSK4                        712
#define ACKDT1                        713
#define ADMSK51                       714
#define ADMSK5                        715
#define ACKDT                         716
#define ACKSTAT                       717
#define ACKSTAT1                      718
#define GCEN                          719
#define GCEN1                         720
#define SSPCON1                       721
#define SSPM0                         722
#define SSPM                          723
#define SSPM01                        724
#define SSPM1                         725
#define SSPM11                        726
#define SSPM2                         727
#define SSPM21                        728
#define SSPM31                        729
#define SSPM3                         730
#define CKP                           731
#define CKP1                          732
#define SSPEN                         733
#define SSPEN1                        734
#define SSPOV1                        735
#define SSPOV                         736
#define WCOL1                         737
#define WCOL                          738
#define SSPSTAT                       739
#define BF                            740
#define BF1                           741
#define UA1                           742
#define UA                            743
#define R_NOT_W                       744
#define READ_WRITE                    745
#define RW1                           746
#define NOT_W                         747
#define I2C_READ                      748
#define nW                            749
#define RW                            750
#define nWRITE                        751
#define R                             752
#define NOT_WRITE                     753
#define R_nW                          754
#define R_W                           755
#define START                         756
#define START1                        757
#define S                             758
#define I2C_START                     759
#define STOP                          760
#define STOP1                         761
#define I2C_STOP                      762
#define P                             763
#define NOT_A                         764
#define nA                            765
#define D_A                           766
#define D_nA                          767
#define D                             768
#define DA1                           769
#define DA                            770
#define DATA_ADDRESS                  771
#define D_NOT_A                       772
#define NOT_ADDRESS                   773
#define nADDRESS                      774
#define I2C_DAT                       775
#define CKE                           776
#define CKE1                          777
#define SMP                           778
#define SMP1                          779
#define SSPADD                        780
#define MSK01                         781
#define MSK0                          782
#define MSK11                         783
#define MSK1                          784
#define MSK21                         785
#define MSK2                          786
#define MSK3                          787
#define MSK31                         788
#define MSK4                          789
#define MSK41                         790
#define MSK51                         791
#define MSK5                          792
#define MSK61                         793
#define MSK6                          794
#define MSK71                         795
#define MSK7                          796
#define T2CON                         797
#define T2CKPS0                       798
#define T2CKPS                        799
#define T2CKPS1                       800
#define TMR2ON                        801
#define T2OUTPS0                      802
#define T2OUTPS                       803
#define T2OUTPS1                      804
#define T2OUTPS2                      805
#define T2OUTPS3                      806
#define PR2                           807
#define WM0                           808
#define WM1                           809
#define WAIT0                         810
#define WAIT1                         811
#define EBDIS                         812
#define T1CON                         813
#define TMR1ON                        814
#define TMR1CS                        815
#define NOT_T1SYNC                    816
#define T1SYNC                        817
#define nT1SYNC                       818
#define T1INSYNC                      819
#define T1OSCEN                       820
#define SOSCEN                        821
#define T1CKPS0                       822
#define T1CKPS                        823
#define T1CKPS1                       824
#define T1RUN                         825
#define T1RD16                        826
#define T1CON_RD16                    827
#define RCON                          828
#define BOR                           829
#define NOT_BOR                       830
#define nBOR                          831
#define POR                           832
#define nPOR                          833
#define NOT_POR                       834
#define PD                            835
#define nPD                           836
#define NOT_PD                        837
#define nTO                           838
#define TO                            839
#define NOT_TO                        840
#define nRI                           841
#define NOT_RI                        842
#define RI                            843
#define NOT_CM                        844
#define RCON_CM                       845
#define nCM                           846
#define IPEN                          847
#define WDTCON                        848
#define SWDTE                         849
#define SWDTEN                        850
#define REGSLP                        851
#define OSCCON                        852
#define SCS0                          853
#define SCS                           854
#define SCS1                          855
#define IOFS                          856
#define OSTS                          857
#define IRCF                          858
#define IRCF0                         859
#define IRCF1                         860
#define IRCF2                         861
#define IDLEN                         862
#define T0CON                         863
#define T0PS                          864
#define T0PS0                         865
#define T0PS1                         866
#define T0PS2                         867
#define PSA                           868
#define T0PS3                         869
#define T0SE                          870
#define T0CS                          871
#define T08BIT                        872
#define TMR0ON                        873
#define STATUS                        874
#define C                             875
#define CARRY                         876
#define DC                            877
#define ZERO                          878
#define Z                             879
#define OV                            880
#define OVERFLOW                      881
#define N                             882
#define NEGATIVE                      883
#define INTCON3                       884
#define INT1IF                        885
#define INT1F                         886
#define INT2IF                        887
#define INT2F                         888
#define INT3F                         889
#define INT3IF                        890
#define INT1E                         891
#define INT1IE                        892
#define INT2IE                        893
#define INT2E                         894
#define INT3E                         895
#define INT3IE                        896
#define INT1P                         897
#define INT1IP                        898
#define INT2IP                        899
#define INT2P                         900
#define INTCON2                       901
#define RBIP                          902
#define INT3IP                        903
#define INT3P                         904
#define TMR0IP                        905
#define T0IP                          906
#define INTEDG3                       907
#define INTEDG2                       908
#define INTEDG1                       909
#define INTEDG0                       910
#define RBPU                          911
#define NOT_RBPU                      912
#define nRBPU                         913
#define INTCON                        914
#define RBIF                          915
#define INT0F                         916
#define INT0IF                        917
#define T0IF                          918
#define TMR0IF                        919
#define RBIE                          920
#define INT0E                         921
#define INT0IE                        922
#define T0IE                          923
#define TMR0IE                        924
#define PEIE                          925
#define PEIE_GIEL                     926
#define GIEL                          927
#define GIE_GIEH                      928
#define GIE                           929
#define GIEH                          930
#define SP0                           931
#define STKPTR                        932
#define STKPTR0                       933
#define SP1                           934
#define STKPTR1                       935
#define STKPTR2                       936
#define SP2                           937
#define SP3                           938
#define STKPTR3                       939
#define STKPTR4                       940
#define SP4                           941
#define STKUNF                        942
#define STKOVF                        943
#define STKFUL                        944

#endif // _PIC18F65J11_H_
